### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
total_player= df["SN"].nunique()
print(total_player)

576

In [4]:
tot_player={"Total Players":total_player}
df3= pd.DataFrame(data=tot_player,index=[0])
df3

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
uni_item = df["Item ID"].nunique()
print(uni_item)

183

In [6]:
average_price= ("$" + str((round(df["Price"].mean(),2))))
print(average_price)

$3.05

In [7]:
num_purch = df["Purchase ID"].count()
print(num_purch)

780

In [8]:
tot_rev= ("$" + str(df["Price"].sum()))
print(tot_rev)

$2379.77

In [9]:
purch_analysis={"Number of Unique Items": uni_item, "Average Price": average_price, "Number of Purchases": num_purch, 
                "Total Revenue": tot_rev}
df2=pd.DataFrame(data=purch_analysis,index=[0])
df2

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [11]:
male_total = sum(df["Gender"]=="Male")
male_total

652

In [12]:
df4 = df.drop_duplicates(subset='SN', keep="first")
df4.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [13]:
df4["Gender"].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
total_male = sum(df4["Gender"]=="Male")
total_male

484

In [15]:
total_female = sum(df4["Gender"]=="Female")
total_female

81

In [16]:
total_other = sum(df4["Gender"]=="Other / Non-Disclosed")
total_other

11

In [17]:
sum_player= df4["Gender"].count()
sum_player

576

In [18]:
percent_male = round((total_male/sum_player)*100,2)
percent_male

84.03

In [19]:
percent_female = round((total_female/sum_player)*100,2)
percent_female

14.06

In [20]:
percent_other = round((total_other/sum_player)*100,2)
percent_other

1.91

In [21]:
gender_demographic = {"Total Count":[total_male,total_female,total_other],
                      "Percentage of PLayers":[percent_male,percent_female,percent_other]}

In [22]:
df5 = pd.DataFrame(data=gender_demographic, index=["Male","Female","Other / Non-Disclosed"])
df5

                       Total Count  Percentage of PLayers
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [23]:
df5=df.drop(df[df['Gender']=="Male"].index)
df_f=df5.drop(df5[df5['Gender']=="Other / Non-Disclosed"].index)
df_f.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [24]:
df6=df.drop(df[df['Gender']=="Female"].index)
df_m=df6.drop(df6[df6['Gender']=="Other / Non-Disclosed"].index)
df_m.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [25]:
df7=df.drop(df[df['Gender']=="Female"].index)
df_o=df7.drop(df7[df7['Gender']=="Male"].index)
df_o.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [26]:
fem_purh_count= df_f["Price"].count()

fem_avg_price=round(df_f["Price"].mean(),2)
fap_ = "$" + str(fem_avg_price) + "0"

fem_tot_purch=round(df_f["Price"].sum(),2)
ftp_ = "$" + str(fem_tot_purch) 

fem_per_person=round((fem_tot_purch/total_female),2)
fpp_ = "$" + str(fem_per_person)
fap_

'$3.20'

In [27]:
male_purh_count= df_m["Price"].count()

male_avg_price=round(df_m["Price"].mean(),2)
map_ = "$" + str(male_avg_price)

male_tot_purch=round(df_m["Price"].sum(),2)
mtp_ = "$" + str(male_tot_purch)

male_per_person=round((male_tot_purch/total_male),2)
mpp_ = "$" + str(male_per_person)
map_

'$3.02'

In [28]:
other_purh_count= df_o["Price"].count()

other_avg_price=round(df_o["Price"].mean(),2)
oap_ = "$" + str(other_avg_price)

other_tot_purch=round(df_o["Price"].sum(),2)
otp_ = "$" + str(other_tot_purch)

other_per_person=round((other_tot_purch/total_other),2)
opp_ = "$" + str(other_per_person)
other_purh_count

15

In [29]:
purchasing_analysis = {"Purchase Count": [fem_purh_count,male_purh_count,other_purh_count],
                       "Average Purchase Price": [fap_,map_,oap_],
                      "Total Purchase Value":[ftp_,mtp_,otp_],
                      "Avg Total Purchase per Person":[fpp_,mpp_,opp_]}
df_pa=pd.DataFrame(data=purchasing_analysis,index=["Female","Male","Other / Non-Disclosed"])
df_pa

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [30]:
a9=(df4["Age"]<10).sum()
a10_14=((df4["Age"]>= 10) & (df4["Age"]<=14)).sum()
a15_19=((df4["Age"]>= 15) & (df4["Age"]<=19)).sum()
a20_24=((df4["Age"]>= 20) & (df4["Age"]<=24)).sum()
a25_29=((df4["Age"]>= 25) & (df4["Age"]<=29)).sum()
a30_34=((df4["Age"]>= 30) & (df4["Age"]<=34)).sum()
a35_39=((df4["Age"]>= 35) & (df4["Age"]<=39)).sum()
a40=(df4["Age"]>= 40).sum()
print(a40)

12

In [31]:
perc_9=round((a9/len(df4["Age"])*100),2)
perc_10_14=round((a10_14/len(df4["Age"])*100),2)
perc_15_19=round((a15_19/len(df4["Age"])*100),2)
perc_20_24=round((a20_24/len(df4["Age"])*100),2)
perc_25_29=round((a25_29/len(df4["Age"])*100),2)
perc_30_34=round((a30_34/len(df4["Age"])*100),2)
perc_35_39=round((a35_39/len(df4["Age"])*100),2)
perc_40=round((a40/len(df4["Age"])*100),2)
print(perc_10_14)

3.82

In [32]:
age_demographic= {"Total Count":[a9,a10_14,a15_19,a20_24,a25_29,a30_34,a35_39,a40],
                 "Percentage of Players": [perc_9,perc_10_14,perc_15_19,perc_20_24,perc_25_29,perc_30_34,perc_35_39,
                                          perc_40]}
df_ad=pd.DataFrame(data=age_demographic,index=["<10","10-14","15-19",'20-24','25-29','30-34','35-39','40+'])
df_ad

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [33]:
p9=df.loc[(df["Age"]< 10)]
p10_14=df.loc[(df["Age"]>= 10) & (df["Age"]<=14)]
p15_19=df.loc[(df["Age"]>= 15) & (df["Age"]<=19)]
p20_24=df.loc[(df["Age"]>= 20) & (df["Age"]<=24)]
p25_29=df.loc[(df["Age"]>= 25) & (df["Age"]<=29)]
p30_34=df.loc[(df["Age"]>= 30) & (df["Age"]<=34)]
p35_39=df.loc[(df["Age"]>= 35) & (df["Age"]<=39)]
p40=df.loc[(df["Age"]>= 40)]
p10_14["Purchase ID"].count()

28

In [34]:
p10_14.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
26,26,Lirtossa84,11,Male,71,Demise,1.61
32,32,Aeralria27,10,Male,133,Faith's Scimitar,4.09
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
54,54,Zhisrisu83,10,Male,25,Hero Cane,4.35
56,56,Raesty92,12,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [35]:
p_c9=p9["Purchase ID"].count()
p_c10_14=p10_14["Purchase ID"].count()
p_c15_19=p15_19["Purchase ID"].count()
p_c20_24=p20_24["Purchase ID"].count()
p_c25_29=p25_29["Purchase ID"].count()
p_c30_34=p30_34["Purchase ID"].count()
p_c35_39=p35_39["Purchase ID"].count()
p_c40=p40["Purchase ID"].count()
print(p_c9)

23

In [40]:
app9=round(p9["Price"].mean(),2)
app_9= "$" + str(app9)

app10_14=round(p10_14["Price"].mean(),2)
app_1014= "$" + str(app10_14)

app15_19=round(p15_19["Price"].mean(),2)
app_1519= "$" + str(app15_19)

app20_24=round(p20_24["Price"].mean(),2)
app_2024= "$" + str(app20_24)

app25_29=round(p25_29["Price"].mean(),2)
app_2529 = "$" + str(app25_29) + "0"

app30_34=round(p30_34["Price"].mean(),2)
app_3034= "$" + str(app30_34)


app35_39=round(p35_39["Price"].mean(),2)
app_3539 = "$" + str(app35_39) + "0"

app40=round(p40["Price"].mean(),2)
app_40= "$" + str(app40)
print(app_9)

$3.35

In [42]:
tpp9=round(p9["Price"].sum(),2)
tpp_9= "$" + str(tpp9)

tpp10_14=round(p10_14["Price"].sum(),2)
tpp_1014= "$" + str(tpp10_14)

tpp15_19=round(p15_19["Price"].sum(),2)
tpp_1519= "$" + str(tpp15_19)

tpp20_24=round(p20_24["Price"].sum(),2)
tpp_2024= "$" + str(tpp20_24)

tpp25_29=round(p25_29["Price"].sum(),2)
tpp_2529 = "$" + str(tpp25_29) + "0"

tpp30_34=round(p30_34["Price"].sum(),2)
tpp_3034 = "$" + str(tpp30_34) + "0"

tpp35_39=round(p35_39["Price"].sum(),2)
tpp_3539= "$" + str(tpp35_39)

tpp40=round(p40["Price"].sum(),2)
tpp_40= "$" + str(tpp40)
print(tpp_9)

$77.13

In [43]:
atp9=round(tpp9/a9,2)
atp_9= "$" + str(atp9)

atp10_14=round(tpp10_14/a10_14,2)
atp_1014= "$" + str(atp10_14)

atp15_19=round(tpp15_19/a15_19,2)
atp_1519= "$" + str(atp15_19)

atp20_24=round(tpp20_24/a20_24,2)
atp_2024= "$" + str(atp20_24)

atp25_29=round(tpp25_29/a25_29,2)
atp_2529= "$" + str(atp25_29)

atp30_34=round(tpp30_34/a30_34,2)
atp_3034= "$" + str(atp30_34)

atp35_39=round(tpp35_39/a35_39,2)
atp_3539= "$" + str(atp35_39)

atp40=round(tpp40/a40,2)
atp_40= "$" + str(atp40)
print(atp_9)

$4.54

In [44]:
purch_analysis_age={"Purchase Count":[p_c9,p_c10_14,p_c15_19,p_c20_24,p_c25_29,p_c30_34,p_c35_39,p_c40],
                   "Average Purchase Price":[app_9,app_1014,app_1519,app_2024,app_2529,app_3034,app_3539,app_40],
                   "Total Purchase Value":[tpp_9,tpp_1014,tpp_1519,tpp_2024,tpp_2529,tpp_3034,tpp_3539,tpp_40],
                   "Avg Total Purchase per Person":[atp_9,atp_1014,atp_1519,atp_2024,atp_2529,atp_3034,atp_3539,atp_40]}
df_paa=pd.DataFrame(data=purch_analysis_age,index=["<10","10-14","15-19",'20-24','25-29','30-34','35-39','40+'])
df_paa

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [74]:
df_ts_tp=df.groupby("SN").sum()
df_ts_tp1=df_ts_tp.sort_values("Price",ascending=False)
df_ts_tp1.head()

             Purchase ID  Age  Item ID  Price
SN
Lisosia93           1630  125      451  18.96
Idastidru52         1999   96      527  15.45
Chamjask73          1306   66      339  13.83
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10

In [171]:
df_ts_tp_li=round(df_ts_tp.loc["Lisosia93"]["Price"],2)
df_ts_tp_li1="$"+str(df_ts_tp_li)

df_ts_tp_id=round(df_ts_tp.loc["Idastidru52"]["Price"],2)
df_ts_tp_id1="$"+str(df_ts_tp_id)

df_ts_tp_ch=round(df_ts_tp.loc["Chamjask73"]["Price"],2)
df_ts_tp_ch1="$"+str(df_ts_tp_ch)

df_ts_tp_ir=round(df_ts_tp.loc["Iral74"]["Price"],2)
df_ts_tp_ir1="$"+str(df_ts_tp_ir)

df_ts_tp_is=round(df_ts_tp.loc["Iskadarya95"]["Price"],2)
df_ts_tp_is1="$"+str(df_ts_tp_is)+"0"
print(df_ts_tp_is1)

$13.10

In [113]:
df_ts_app=df.groupby("SN").mean()
df_ts_app.head()

df_ts_app_li=round(df_ts_app.loc["Lisosia93"]["Price"],2)
df_ts_app_li1="$"+str(df_ts_app_li)

df_ts_app_id=round(df_ts_app.loc["Idastidru52"]["Price"],2)
df_ts_app_id1="$"+str(df_ts_app_id)

df_ts_app_ch=round(df_ts_app.loc["Chamjask73"]["Price"],2)
df_ts_app_ch1="$"+str(df_ts_app_ch)

df_ts_app_ir=round(df_ts_app.loc["Iral74"]["Price"],2)
df_ts_app_ir1="$"+str(df_ts_app_ir)+"0"

df_ts_app_is=round(df_ts_app.loc["Iskadarya95"]["Price"],2)
df_ts_app_is1="$"+str(df_ts_app_is)
print(df_ts_app_is1)

$4.37

In [90]:
df_ts_pc=df.groupby("SN").count()
df_ts_pc.loc["Lisosia93"]["Purchase ID"]

df_ts_pc_li=df_ts_pc.loc["Lisosia93"]["Purchase ID"]
df_ts_pc_id=df_ts_pc.loc["Idastidru52"]["Purchase ID"]
df_ts_pc_ch=df_ts_pc.loc["Chamjask73"]["Purchase ID"]
df_ts_pc_ir=df_ts_pc.loc["Iral74"]["Purchase ID"]
df_ts_pc_is=df_ts_pc.loc["Iskadarya95"]["Purchase ID"]
print(df_ts_pc_is)

3

In [211]:
top_spenders={"Purchase Count":[df_ts_pc_li,df_ts_pc_id,df_ts_pc_ch,df_ts_pc_ir,df_ts_pc_is],
              "Average Purchase Price":[df_ts_app_li1,df_ts_app_id1,df_ts_app_ch1,df_ts_app_ir1,df_ts_app_is1],
              "Total Purchase Value": [df_ts_tp_li1,df_ts_tp_ir1,df_ts_tp_ch1,df_ts_tp_ir1,df_ts_tp_is1]}
df_ts=pd.DataFrame(data=top_spenders,index=["Lisosia93","Idastidru52","Chamjask73","Iral74","Iskadarya95"])
df_ts.index.name="SN"
df_ts

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $13.62
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [127]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [183]:
df_mpi=df.groupby("Item ID")
df_mpi_pc=df_mpi.count().sort_values("Age",ascending=False).head()
df_mpi_pc.head()

         Purchase ID  SN  Age  Gender  Item Name  Price
Item ID
178               12  12   12      12         12     12
145                9   9    9       9          9      9
108                9   9    9       9          9      9
82                 9   9    9       9          9      9
19                 8   8    8       8          8      8

In [184]:
df_mpi_pc_178=df_mpi_pc.loc[178]["Item Name"]
df_mpi_pc_145=df_mpi_pc.loc[145]["Item Name"]
df_mpi_pc_108=df_mpi_pc.loc[108]["Item Name"]
df_mpi_pc_82=df_mpi_pc.loc[82]["Item Name"]
df_mpi_pc_19=df_mpi_pc.loc[19]["Item Name"]
print(df_mpi_pc_82)

9

In [197]:
df_mpi_ip=df_mpi.mean()
df_mpi_ip_178=round(df_mpi_ip.loc[178]["Price"],2)
df_mpi_ip_178_1="$"+str(df_mpi_ip_178)

df_mpi_ip_145=round(df_mpi_ip.loc[145]["Price"],2)
df_mpi_ip_145_1="$"+str(df_mpi_ip_145)

df_mpi_ip_108=round(df_mpi_ip.loc[108]["Price"],2)
df_mpi_ip_108_1="$"+str(df_mpi_ip_108)

df_mpi_ip_82=round(df_mpi_ip.loc[82]["Price"],2)
df_mpi_ip_82_1="$"+str(df_mpi_ip_82)+"0"

df_mpi_ip_19=round(df_mpi_ip.loc[19]["Price"],2)
df_mpi_ip_19_1="$"+str(df_mpi_ip_19)
print(df_mpi_ip_82_1)

$4.90

In [199]:
df_mpi_tpv=df_mpi.sum()
df_mpi_tpv_178=round(df_mpi_tpv.loc[178]["Price"],2)
df_mpi_tpv_178_1="$"+str(df_mpi_tpv_178)

df_mpi_tpv_145=round(df_mpi_tpv.loc[145]["Price"],2)
df_mpi_tpv_145_1="$"+str(df_mpi_tpv_145)

df_mpi_tpv_108=round(df_mpi_tpv.loc[108]["Price"],2)
df_mpi_tpv_108_1="$"+str(df_mpi_tpv_108)

df_mpi_tpv_82=round(df_mpi_tpv.loc[82]["Price"],2)
df_mpi_tpv_82_1="$"+str(df_mpi_tpv_82)+"0"

df_mpi_tpv_19=round(df_mpi_tpv.loc[19]["Price"],2)
df_mpi_tpv_19_1="$"+str(df_mpi_tpv_19)
print(df_mpi_tpv_82_1)

$44.10

In [223]:
most_popular_item={"Purchase Count": [df_mpi_pc_178,df_mpi_pc_145,df_mpi_pc_108,df_mpi_pc_82,df_mpi_pc_19],
                  "Item Price": [df_mpi_ip_178_1,df_mpi_ip_145_1,df_mpi_ip_108_1,df_mpi_ip_82_1,df_mpi_ip_19_1],
                  "Total Purchase Value": [df_mpi_tpv_178_1,df_mpi_tpv_145_1,df_mpi_tpv_108_1,df_mpi_tpv_82_1,df_mpi_tpv_19_1]}
df_mpi_ii_in=pd.DataFrame(data=most_popular_item,index=[[178,145,108,82,19],["Oathbreaker, Last Hope of the Breaking Storm",
                                                                             "Fiery Glass Crusader","Extraction, Quickblade Of Trembling Hands",
                                                                            "Nirvana","Pursuit, Cudgel of Necromancy"]])

df_mpi_ii_in.index.names="Item ID","Item Name"
df_mpi_ii_in

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [242]:
df_mpi_=df.groupby(["Item ID","Item Name"])

df_mpi1_tpv=df_mpi_.sum().sort_values("Price",ascending=False)

df_mpi1_tpv.head()

                                                      Purchase ID  Age  Price
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm         4960  287  50.76
82      Nirvana                                              2761  215  44.10
145     Fiery Glass Crusader                                 4345  187  41.22
92      Final Critic                                         3773  195  39.04
103     Singed Scalpel                                       3947  178  34.80

In [259]:
df_mpi1_pc=df_mpi.count()

df_mpi1_pc_178=df_mpi1_pc.loc[178]["Age"]
df_mpi1_pc_82=df_mpi1_pc.loc[82]["Age"]
df_mpi1_pc_145=df_mpi1_pc.loc[145]["Age"]
df_mpi1_pc_92=df_mpi1_pc.loc[92]["Age"]
df_mpi1_pc_103=df_mpi1_pc.loc[103]["Age"]
print(df_mpi1_pc_103)

8

In [264]:
df_mpi1_ip=df_mpi.mean()

df_mpi1_ip_178=round(df_mpi1_ip.loc[178]["Price"],2)
df_mpi1_ip_178_1="$"+str(df_mpi1_ip_178)

df_mpi1_ip_82=round(df_mpi1_ip.loc[82]["Price"],2)
df_mpi1_ip_82_1="$"+str(df_mpi1_ip_82)+"0"


df_mpi1_ip_145=round(df_mpi1_ip.loc[145]["Price"],2)
df_mpi1_ip_145_1="$"+str(df_mpi1_ip_145)

df_mpi1_ip_92=round(df_mpi1_ip.loc[92]["Price"],2)
df_mpi1_ip_92_1="$"+str(df_mpi1_ip_92)

df_mpi1_ip_103=round(df_mpi1_ip.loc[103]["Price"],2)
df_mpi1_ip_103_1="$"+str(df_mpi1_ip_103)
print((df_mpi1_ip_82_1))

$4.90

In [266]:
df_mpi1_tpv=df_mpi.sum()

df_mpi1_tpv_178=round(df_mpi1_tpv.loc[178]["Price"],2)
df_mpi1_tpv_178_1="$"+str(df_mpi1_tpv_178)

df_mpi1_tpv_82=round(df_mpi1_tpv.loc[82]["Price"],2)
df_mpi1_tpv_82_1="$"+str(df_mpi1_tpv_82)+"0"

df_mpi1_tpv_145=round(df_mpi1_tpv.loc[145]["Price"],2)
df_mpi1_tpv_145_1="$"+str(df_mpi1_tpv_145)

df_mpi1_tpv_92=round(df_mpi1_tpv.loc[92]["Price"],2)
df_mpi1_tpv_92_1="$"+str(df_mpi1_tpv_92)

df_mpi1_tpv_103=round(df_mpi1_tpv.loc[103]["Price"],2)
df_mpi1_tpv_103_1="$"+str(df_mpi1_tpv_103)+"0"
print(df_mpi1_tpv_82_1)

$44.10

In [268]:
most_profitable_items= {"Purchase Count":[df_mpi1_pc_178,df_mpi1_pc_82,df_mpi1_pc_145,df_mpi1_pc_92,df_mpi1_pc_103],
                        "Item Price":[df_mpi1_ip_178_1,df_mpi1_ip_82_1,df_mpi1_ip_145_1,df_mpi1_ip_92_1,df_mpi1_ip_103_1],
                        "Total Purchase Value":[df_mpi1_tpv_178_1,df_mpi1_tpv_82_1,df_mpi1_tpv_145_1,df_mpi1_tpv_92_1,df_mpi1_tpv_103_1]}

df_mpi_ii_in_1=pd.DataFrame(data=most_profitable_items,index=[[178,82,145,92,103],
                                                              ["Oathbreaker, Last Hope of the Breaking Storm","Nirvana",
                                                              "Fiery Glass Crusader","Final Critic","Singed Scalpel"]])
df_mpi_ii_in_1.index.names="Item ID","Item Name"
df_mpi_ii_in_1

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80